joey9D/HardwareAPI/Project/MCU_driver_API/HW_API/stm32/stm32c0/Src/stm32c0_hw.cpp
/*
 * stm32c0_hw.cpp
 *
 *  Created on: Jul 10, 2025
 *      Author: jan.kristel
 */
#include <assert.h>
#include <type_traits>
#include "stm32c0xx_hal.h"
#include "stm32c0_hw.hpp"
#include "stm32x0_gpio_mapping.hpp"
#include "timer.hpp"

void Stm32c0_hw::init_sys()
	{
		HAL_Init();
		init_clock();
	}

	// clock
void Stm32c0_hw::init_clock()
{
	RCC_OscInitTypeDef OscInitStruct = {0};
	RCC_ClkInitTypeDef ClkInitStruct = {0};

	__HAL_FLASH_SET_LATENCY(FLASH_LATENCY_1);

	OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
	OscInitStruct.HSEState = RCC_HSE_ON;

	HAL_RCC_OscConfig(&OscInitStruct);

	ClkInitStruct.ClockType = RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_PCLK1;
	ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_HSE;
	ClkInitStruct.SYSCLKDivider = RCC_SYSCLK_DIV1;
	ClkInitStruct.AHBCLKDivider = RCC_HCLK_DIV1;
	ClkInitStruct.APB1CLKDivider = RCC_APB1_DIV1;

	HAL_RCC_ClockConfig(&ClkInitStruct, FLASH_LATENCY_1);
}

void Stm32c0_hw::delay(uint32_t ms)
{
	HAL_Delay(ms);
}




















